{"pages":[{"title":"","text":"Error 404 - Page Not Found! Halaman yang Anda cari tidak ditemukan. Bisa jadi karena url tersebut salah atau tidak tersedia. Silahkan kembali","link":"/404.html"},{"title":"Tentang Saya","text":"Situs ini dikelola secara pribadi oleh ‘Krisna Amarta’, yang kebanyakan isinya membahas tentang desain, pemrograman, dan beberapa pembahasan teknologi lainnya. TujuanTujuan dibuatnya situs ini ya itu untuk menyimpan catatan &amp; dokumentasi tentang beberapa hal yang saya anggap penting dan berguna bagi saya, maupun para pembaca. Dengan apa situs ini dibuat?Situs ini dibuat menggunakan Hexo, dan dihosting langsung menggunakan Github Pages, kalian bisa melihat source code dari situs ini di Github saya. Selain itu kalian bisa mendownload source situs ini secara langsung, dengan menyalin kode dibawah ini, lalu paste-kan di terminal. Salin kode ini1git clone https://github.com/krisnaxda/krisnaxda.github.io.git","link":"/about/index.html"},{"title":"Lisensi","text":"Creative CommonsKarya dilisensikan dibawah Creative Commons Atribusi-NonKomersial 4.0 Internasional (CC BY-NC 4.0) Anda bisa membaca informasi lengkap tentang lisensi ini di Halaman Ini. Anda Diperbolehkan: Berbagi - menyalin dan menyebarluaskan kembali isi situs ini dalam bentuk atau format apapun Mengubah - mengubah dan membuat versi lain dari situs ini. Sebelum mengubah, ataupun membagikan materi dari situs ini, ada ketentuan-ketentuan yang harus dipatuhi. Berdasarkan Ketentuan Berikut: Atribusi - Anda harus mencantumkan nama yang sesuai, mencantumkan tautan terhadap lisensi, dan menyatakan bahwa telah ada perubahan yang dilakukan. Anda dapat melakukan hal ini dengan cara yang sesuai, namun tidak mengisyaratkan bahwa pemberi lisensi mendukung Anda atau penggunaan Anda. NonKomersial - Anda tidak dapat menggunakan materi ini untuk kepentingan komersial. Tidak ada pembatasan tambahan — Anda tidak dapat menggunakan ketentuan hukum atau sarana kontrol teknologi yang secara hukum membatasi orang lain untuk melakukan hal-hal yang diizinkan lisensi ini. Pemberitahuan: Anda tidak perlu menaati lisensi untuk bagian materi ini yang telah berada di bawah domain publik atau untuk penggunaan yang diizinkan di bawah pengecualian atau pembatasan. Tidak ada jaminan yang diberikan oleh lisensi ini. Lisensi ini mungkin tidak memberikan izin yang sesuai dengan tujuan penggunaan Anda. Sebagai contoh, hak-hak lainnya seperti hak atas potret, hak atas privasi, atau hak moral dapat membatasi penggunaan materi berlisensi CC. Pelajari lebih lanjut tentang penggunaan lisensi CC, atau gunakan lisensi ini untuk ciptaan Anda.","link":"/cc-by-nc/index.html"},{"title":"Privacy Policy for Sirkloud","text":"At Sirkloud, accessible from krisnaxda.xyz, one of our main priorities is the privacy of our visitors. This Privacy Policy document contains types of information that is collected and recorded by Sirkloud and how we use it. If you have additional questions or require more information about our Privacy Policy, do not hesitate to contact us. Log Files Sirkloud follows a standard procedure of using log files. These files log visitors when they visit websites. All hosting companies do this and a part of hosting services' analytics. The information collected by log files include internet protocol (IP) addresses, browser type, Internet Service Provider (ISP), date and time stamp, referring/exit pages, and possibly the number of clicks. These are not linked to any information that is personally identifiable. The purpose of the information is for analyzing trends, administering the site, tracking users' movement on the website, and gathering demographic information. Google DoubleClick DART Cookie Google is one of a third-party vendor on our site. It also uses cookies, known as DART cookies, to serve ads to our site visitors based upon their visit to www.website.com and other sites on the internet. However, visitors may choose to decline the use of DART cookies by visiting the Google ad and content network Privacy Policy at the following URL – https://policies.google.com/technologies/ads Privacy Policies You may consult this list to find the Privacy Policy for each of the advertising partners of Sirkloud. Our Privacy Policy was created with the help of the Free Privacy Policy Generator and the Privacy Policy Generator Online. Third-party ad servers or ad networks uses technologies like cookies, JavaScript, or Web Beacons that are used in their respective advertisements and links that appear on Sirkloud, which are sent directly to users' browser. They automatically receive your IP address when this occurs. These technologies are used to measure the effectiveness of their advertising campaigns and/or to personalize the advertising content that you see on websites that you visit. Note that Sirkloud has no access to or control over these cookies that are used by third-party advertisers. Third Party Privacy Policies Sirkloud's Privacy Policy does not apply to other advertisers or websites. Thus, we are advising you to consult the respective Privacy Policies of these third-party ad servers for more detailed information. It may include their practices and instructions about how to opt-out of certain options. You can choose to disable cookies through your individual browser options. To know more detailed information about cookie management with specific web browsers, it can be found at the browsers' respective websites. What Are Cookies? Children's Information Another part of our priority is adding protection for children while using the internet. We encourage parents and guardians to observe, participate in, and/or monitor and guide their online activity. Sirkloud does not knowingly collect any Personal Identifiable Information from children under the age of 13. If you think that your child provided this kind of information on our website, we strongly encourage you to contact us immediately and we will do our best efforts to promptly remove such information from our records. Online Privacy Policy Only This Privacy Policy applies only to our online activities and is valid for visitors to our website with regards to the information that they shared and/or collect in Sirkloud. This policy is not applicable to any information collected offline or via channels other than this website. Consent By using our website, you hereby consent to our Privacy Policy and agree to its Terms and Conditions.","link":"/privacy-policy/index.html"}],"posts":[{"title":"Memasang Banyak Font Sekaligus di Linux Mint","text":"Salah satu hal utama bagi para desainer grafis adalah memilih dan menggunakan font secara tepat. Namun pada distro Linux Mint Mate saya mengalami beberapa kendala saat memasang / menginstall font. Beberapa kendala yang saya alami saat memasang font dengan yaitu proses pemasangan yang agak lama, Mate Font Viewer tidak memberikan alert ketika font sudah terpasang, tidak bisa memasang font lebih dari 1 secara langsung. Tapi setelah 5 menit saya mencoba mencari-cari letak folder font, akhirnya saya menemukan solusi dari semua masalah tersebut. Memasang Font Secara ManualMaksud dari memasang font secara manual adalah memasang font tanpa menggunakan bantuan font viewer seperti Mate Font ViewerBagaimana caranya? Simak dibawah ini. Pertama - tama siapkan font yang akan dipasang, lalu buka file manajer kalian. Lalu arahkan direktori file manajer ke /home/user seperti gambar dibawah. User adalah nama user kalian. Lalu setelah itu, buka folder .local, pastikan opsi show hidden folders aktif, jika tidak maka folder .local tidak akan muncul. Di dalam .local terdapat folder share, kalian buka saja, kemudian pilih folder fonts. Jadi nantinya seperti ini /home/user/.local/share/fonts. Setelah itu kalian tinggal copy font yang akan di install lalu paste pada folder tersebut.Kalian juga bisa memasang banyak font dengan cara ini, cukup pilih font mana yang akan dipasang, lalu salin di folder tersebut. Catatan Cara ini bisa kalian lakukan di ubuntu, dan beberapa distro turunan ubuntu. Sampai disini saja pembahasannya, jika ada pertanyaan langsung saja tanya di kolom komentar dibawah, terima kasih telah membaca.","link":"/Memasang-Font-di-Linux-Mint/"},{"title":"Cara Mengubah Kuota by.U Instagram Menjadi Kuota Reguler","text":"By.U adalah provider digital pertama yang ada di Indonesia, jika kalian ingin kartu yang tidak ada batas masa aktifnya, by.U adalah jawabannya. by.U menyediakan paket yang berbeda-beda, salah satunya yaitu paket khusus untuk instagram. Kuota untuk instagram itu ternyata bisa diubah menjadi kuota reguler loh. Tutorial Diupdate Juni 2020 Hal yang dibutuhkan Aplikasi Wireguard - bisa ditemukan di Google Playstore Config Wireguard - bisa dibuat gratis di berbagai web Buat Config WireguardSetelah kamu menginstall Wireguard, sekarang yang dibutuhkan adalah config wireguard. Config tersebut bisa kalian buat di berbagai web penyedia layanan vpn gratis seperti fastssh,jagoanssh, oceanssh, dan lainnya. Kali ini saya beri petunjuk bagaimana cara membuat config wireguard di fastssh.com Pertama buka website ini dan pilih server yang masih tersedia, saya sarankan gunakan server indonesia atau singapura. Lalu buat buat config atau akun wireguardnya, nantinya setelah mengisi username dan password config,akan muncul tampilan seperti dibawah ini, kemudian tekan download, untuk mengunduh confignya. Config Wireguard selesai dibuat, sekarang saatnya mengubah config tersebut agar bisa digunakan untuk mengubah kuota instagram by.U ke kuota reguler. Mengubah Config WireguardBuka aplikai wireguard kamu, lalu tambah konfig yang sudah dibuat dibagian bawah app yang bertuliskan import from file or archive, atau kalau mau simpel scan saja barcode yang tertera seperti foto diatas Setelah itu edit config tersebut agar support untuk mengubah kuota instagram menjadi reguler dengan cara menambahkan bug host di bagian endpoint. Tambahkan kode dibawah ini, pada bagian awal endpoint Salin kode ini1instagram.fcgk8-1.fna.fbcdn.net. hasilnya nanti seperti gambar dibawah ini lalu simpan settingan tadi dan coba jalankan config tersebut, lalu cek dengan browsing di google atau buka youtube, selamat! Kuota instagram sudah berubah menjadi kuota reguler. Sekian informasi yang bisa saya berikan, silahkan berikan komentar dibawah jika ada kendala atau bagian yang tidak jelas, saya akan membalasnya satu persatu.","link":"/mengubah-kuota-byu-instagram/"},{"title":"3 Situs Penyedia Blog Gratis dan Simpel","text":"Sesusai dengan judul artikelnya, kali ini saya akan membahas dan memberikan beberapa rekomendasi situs web terbaik untuk membuat blog gratis, ya gratis, tanpa biaya apapun. Kenapa saya harus membuat blog? Karena blog sangat bermanfaat bagi teman-teman yang suka menulis dan berbagi cerita, tips &amp; trik, karya sastra, ataupun menyimpan beberapa informasi. Bahkan kalian bisa mendapatkan penghasilan tambahan dari blog yang dibuat. Saran saya bagi teman-teman yang suka menulis catatan dibuku, mulai sekarang coba beralih menulis di blog, tidak ada ruginya sama sekali. Namun untuk membuat blog dibutuhkan sebuah hosting untuk menyimpan isi dari blog. Namun teman-teman tidak perlu khawatir karena saya akan memberikan rekomendasi. Berikut ini adalah beberapa rekomendasi situs web untuk membuat blog gratis Blogger.com Blogger adalah salah satu layanan penyedia blog gratis yang dibuat oleh google. Kalian bisa membuat blog di situs ini dengan login dengan akun gmail kalian. Saya sangat merekomendasikan situs ini, karena tampilan di Blogger lebih mudah dan simpel untuk mengatur blog. Nantinya nama blog kalian seperti ini namablogkalian.blogger.com Selain itu kalian bisa mendaftarkan blog kalian di situs penyedia iklan google adsense dengan mudah, karena sama-sama dibuat oleh Google. WordPress.com WordPress adalah sebuah situs web yang sangat terkenal untuk membuat blog, lebih dari 60 juta website dibuat menggunakan WordPress. Teman-teman bisa membuat blog dengan simpel tanpa perlu mempelajari bahasa pemrograman di WordPress. Nantinya nama blog atau web yang kalian buat nanti berakhiran seperti ini namablogkalian.wordpress.com. Wix.com Wix adalah salah satu yang masuk dari rekomendasi saya, ya, mungkin kalian pernah melihat iklan situs ini di berbagai tempat. Terdapat puluhan template yang tersedia untuk blog kalian di situs ini, bahkan kalian bisa membuat toko online dengan template yang ada di situs ini. Tambahan Sebenarnya masih banyak situs web yang menyediakan layanan untuk membuat blog dengan gratis, namun saya lebih menyarankan 3 situs diatas, dan tambahan rekomendasi saya dibawah ini. Medium.com Medium saya tambahkan karena di situs ini kalian bisa menulis dengan bebas dan berbagi ke semua orang, sama seperti catatan namun bersifat publik. Terdapat banyak tulisan-tulisan yang menarik dan informatif di situs ini, bahkan saya membuat blog ini dengan bantuan tutorial dari salah satu tulisan di Medium. Penutup Sekian dari tulisan saya, jangan ragu untuk bertanya-tanya di komentar, saya akan balas secepatnya. Jika ada kesalahan informasi atau tulisan, tolong beritahu saya. Terima kasih telah membaca artikel ini","link":"/situs-untuk-membuat-blog-gratis/"},{"title":"Jangan Remehkan Privasi dan Datamu di Internet","text":"Ketika saya melihat suatu kabar tentang kabar kebocoran data ataupun penjualan data pengguna internet, pasti menemukan seseorang yang berkomentar dengan model seperti ini “halah, buat apa nyuri data saya, biarin aja data saya dicuri,lagian data gak penting juga.“ Bagi saya, orang yang komentar seperti itu sangat menyepelekan privasi mereka sendiri. Padahal setiap privasi tentang aktivitas dan data mereka berinternet sangat berharga meskipun isinya contohnya seperti waktu penggunaan, umur, gender, dan sebagainya. Bagaimana Data Sekecil Itu Bisa Berharga?Begini misalnya kamu punya uang koin 100 rupiah, ya uang ini gak bisa dibu uang koin dan dataat untuk beli bakso, namun jika kamu mengumpulkan pecahan 100 rupiah tersebut sampai 100 kali, akhirnya terkumpul 10.000 rupiah, terbelilah bakso tadi. Jika kita samakan uang koin 100 rupiah tadi dengan data kecil diatas, hasilnya sama saja, ada jutaan orang yang mengakses sosial media, jika data tersebut dikumpulkan menjadi satu maka sangat berharga. Jadi, jangan anggap remeh lagi tentang pencurian ataupun pengumpulan data oleh sejumlah situs. Tahukah kamu? Ketika kamu mengunjungi website saya ini, secara tidak langsung kamu sudah memberikan data kamu ke web analisis saya. Yang berarti saya bisa melihat dimana lokasi pengunjung web ini mengakses, browser apa yang digunakan, os apa yang digunakan, dsb. Tapi tenang saja, tujuan saya memasang Google Analytics di situs ini hanya untuk melihat statistik pembaca tentang artikel mana yang menarik dan tidak. Lalu bagaimana dengan situs terkenal lainnya? saya ambil contoh dari Facebook, mereka memanfaatkan data pengguna seperti lokasi, umur, minat pengguna, dan gender untuk memaksimalkan jangkauan iklan yang ditarget oleh para pengiklan di Facebook. Jadi secara tidak langsung menurut saya itu sama seperti menjual data pengguna untuk diberikan kepada pengiklan, meskipun data tersebut bukan tergolong data yang bersifat pribadi. Bagaimana cara menghindari pelacak untuk mengambil data dan aktivitas kita di internet? Caranya cukup simpel, jangan gunakan layanan dari mereka, cari alternatif layanan lainnya. Selain itu masih ada banyak cara seperti mematikan cookies pada browser, membatasi hak akses aplikasi, dan sebagainya. Mungkin saya akan menulis tentang pembahasan ini di artikel selanjutnya.Saya ada tips tambahan yang mungkin membantu untuk menjaga privasi kalian, yaitu menggunakan browser yang mengutamakan privasi Sekian pembahasan ini, bebas tanggapi opini saya ini di kolom komentar. Jika ada kesalahan informasi ataupun tulisan, tolong beritahu saya. Terimakasih","link":"/jangan-remehkan-privasi-data-di-internet/"},{"title":"Mencoba Brave Browser yang Mengutamakan Privasi","text":"Brave Browser adalah sebuah browser yang mementingkan privasi kepada pengguna yang bersifat sumber terbuka atau opensource. Brave Browser di ketuai oleh Brendan Eich, co-founder dari projek Mozilla dan pencipta JavaScript. Brave Browser ini dibangun dengan sumber dari Projek Chromium, mereka mengklaim bahwa privasi sangat penting, dan mereka menjamin setiap aktivitas tracking, iklan, mining akan diblokir. Melihat dari cara promosi mereka, saya penasaran dan ingin mencoba browser tersebut. Sebelumnya saya selalu menggunakan Chromium karena mudah untuk diintegrasikan ke device lain, dan juga karena bersifat opensource. Jadi saya sangat familiar dengan tombol shortcut, konfigurasi, dan pengaturan yang ada di Brave Browser, karena browser ini dibuat dengan dasar Chromium. Brave ShieldsBrave Shields merupakan fitur dari Brave Browser yang berguna untuk menjaga privasi pengguna, dan memblokir semua iklan yang menggangu seperti iklan pop up. Selain itu ada opsi untuk mengarahkan semua situs yang diakses dari http ke https agar lebih aman, dan juga ada opsi untuk mematikan script agar bisa memblokir cookies. Brave rewardsKarena browser ini memblokir semua iklan, lalu mereka berinisiasi untuk mendukung kreator situs web dengan brave rewards. Pengguna bisa mengaktifkan fitur ini dan mendukung kreator web dengan memberikan Token BAT yang bisa didapat dengan mengklik iklan dari brave, bukan dari websitenya. Token yang kamu dapat bisa diberikan kepada kreator web sebagai bentuk support kamu, atau bisa kamu digunakan sendiri dan menariknya dalam bentuk uang.Fitur ini bisa dimatikan jika kamu tidak tertarik dengan iklan dari Brave. Brave TorMau browsing lebih aman? Brave Tor jawabannya, fitur ini menjamin kamu akan terkoneksi di internet lebih aman, sama seperti Tor Browser. Karena koneksi kalian tidak terhubung secara langsung ke situs yang dituju, sehingga alamat IP asli kamu tersembunyi. Brave Tor juga bisa digunakan untuk mengakses Dark Web, sama persis seperti Tor Browser. TampilanDari segi tampilan sama saja seperti Chromium namun yang saya suka dari brave adalah adanya opsi dark mode pada pengaturannya, beda dengan Chromium yang tidak menyediakan opsi dark mode. Selain itu ada beberapa hal baru, pada homepage tidak lagi ada tampilan search engine yang membosankan seperti Chrome ataupun Firefox. Brave mengganti tampilan homepage dengan widget top sites, brave rewards, jam dan dengan wallpaper yang selalu berganti setiap homepage dibuka. Kecepatan &amp; PenggunaanBrave Browser ini saya anggap sangat cepat untuk memuat halaman di berbagai web, karena dari fitur Brave Shields tadi yang membantu memblokir tracker, iklan, script, dsb. Manajemen memori pada brave cukup baik sehingga tidak memakan banyak memori pada komputer saya. Berbeda ketika menggunakan Chrome, saya harus menutup beberapa aplikasi. KekuranganSejauh ini tidak ada kekurangan menurut saya terhadap browser ini, malah menurut saya brave ini sebagai versi sempurnyanya Chromium. Meskipun dulu browser ini pernah terlibat masalah karena ketahuan menambah link refferal pada beberapa situs crypto, namun karena sifatnya yang opensource masalah tersebut bisa diselesaikan dengan cepat. Dukungan Sistem OperasiOh iya, brave browser ini tersedia untuk semua platform seperti Android, IOS, Linux, MacOS, dan juga Windows. Bagaimana Menurutmu? Berikan komentarmu tentang browser ini. Sekian pembahasan saya tentang Brave Browser ini, jika ada kesalahan pada artikel ini tolong beritahu saya pada kolom komentar, atau kontak saya.","link":"/mencoba-brave-browser/"},{"title":"Rekomendasi Situs Penyedia Font Gratis","text":"Jika kalian sering menggunakan font kustom yang diunduh dari internet, maka harus berhati-hati! Kalian harus memperhatikan lisensinya, jangan mentang-mentang ada tulisan gratis lalu bisa bebas digunakan. Karena setiap font yang beredar di internet menggunakan lisensi yang berbeda-beda. Berikut ini adalah jenis lisensi font yang harus teman-teman ketahui Free for personal use, lisensi ini bagi saya sudah cukup jelas maksudnya, yaitu kita bebas menggunakan font hanya untuk penggunaan pribadi, contohnya digunakan untuk presentasi belajar dan tidak boleh digunakan untuk kegiatan komersil. Demo, lisensi ini berarti bahwa font tersebut hanya untuk percobaan untuk versi full dari font tersebut, font ini boleh digunakan untuk kegiatan personal namun tidak untuk kegiatan komersil. 100% Free, lisensi ini berarti font yang diunduh benar-benar gratis dan bebas digunakan untuk apa saja, baik itu untuk penggunaan personal ataupun komersil. Donationware, lisensi ini berarti bahwa font tersebut boleh digunakan ketika pengguna sudah memberikan donasi kepada pemilik atau pembuat font. Open Font License atau biasa disingkat OFL, lisensi ini berarti bahwa font tersebut bersifat gratis dan terbuka, sama seperti lisensi 100% Free namun bedanya kalian bisa bebas mengubah, mengkustom, maupun menyebarkan font ini. Sebenarnya masih ada jenis lisensi yang belum saya sebutkan diatas, kalian bisa melihat semuanya di Daftar Jenis Lisensi Font . Berikut ini adalah situs penyedia font gratis yang saya rekomendasikan, Google FontsGoogle Fonts adalah situs penyedia font dengan lisensi OFL, di Google Fonts kalian bisa melihat tampilan dan membandingkan jenis-jenis font yang cocok untuk digunakan bersamaan. Tampilan dari situs ini sangat simpel dan mudah digunakan, tidak ada iklan, dan juga informasi tentang lisensi fontnya juga jelas. Font SquirrelFont Squirrel, Situs ini menyediakan berbagai font dari yang berbayar sampai gratis, namun fokus dari situs ini yaitu font yang 100% gratis. Tampilan dari situs ini cukup menarik dan informatif karena kalian bisa menggunakan filter lisensi sehingga tidak perlu khawatir salah mengunduh jenis font. FontSpaceFontSpace adalah situs penyedia font yang sangat unik dan keren, di situs ini kalian bisa mencari font yang benar-benar gratis dengan filter pencarian di situs ini. Begitu juga font yang tersedia di situs ini cukup berkualitas dan unik, wepfont adalah salah satu kreator yang menyediakan banyak font dengan lisensi 100% free. PenutupDimana Dafont? Kok gak masuk daftar diatas?Saya tidak memasukkan dafont didalam daftar karena informasi tentang lisensi di dafont masih sangat minim. Saya pernah melihat font dengan lisensi 100% Free namun didalam informasi yang kreator tulis beda, hanya boleh untuk personal.Selain itu banyak kreator disana yang tidak memberikan info lebih lanjut terhadap font yang mereka publish. Sampai disini dulu pembahasan saya, jika ada kesalahan kata atau informasi di artikel ini, tolong segera beri tahu saya, Jangan lupa berikan komentar kalian terhadap rekomendasi saya","link":"/situs-penyedia-font-gratis/"}],"tags":[{"name":"Linux Mint","slug":"Linux-Mint","link":"/tags/Linux-Mint/"},{"name":"Font","slug":"Font","link":"/tags/Font/"},{"name":"Desain","slug":"Desain","link":"/tags/Desain/"},{"name":"Jaringan","slug":"Jaringan","link":"/tags/Jaringan/"},{"name":"Tips &amp; Trik","slug":"Tips-Trik","link":"/tags/Tips-Trik/"},{"name":"Rekomendasi","slug":"Rekomendasi","link":"/tags/Rekomendasi/"},{"name":"Blog","slug":"Blog","link":"/tags/Blog/"},{"name":"Internet","slug":"Internet","link":"/tags/Internet/"},{"name":"Privasi","slug":"Privasi","link":"/tags/Privasi/"},{"name":"Software","slug":"Software","link":"/tags/Software/"},{"name":"Brave Browser","slug":"Brave-Browser","link":"/tags/Brave-Browser/"}],"categories":[{"name":"Desain","slug":"Desain","link":"/categories/Desain/"},{"name":"Android","slug":"Android","link":"/categories/Android/"},{"name":"Blog","slug":"Blog","link":"/categories/Blog/"},{"name":"Opini","slug":"Opini","link":"/categories/Opini/"},{"name":"Review","slug":"Review","link":"/categories/Review/"},{"name":"Linux","slug":"Linux","link":"/categories/Linux/"},{"name":"Font","slug":"Desain/Font","link":"/categories/Desain/Font/"}]}